import laptopImg1 from "../img/laptop1.jpg";
import laptopImg2 from "../img/laptop2.jpg";
import laptopImg3 from "../img/laptop3.jpg";
import laptopImg4 from "../img/laptop4.jpg";
import laptopImg5 from "../img/laptop5.jpg";
import laptopImg6 from "../img/laptop6.jpg";
import laptopImg7 from "../img/laptop7.jpg";
import laptopImg8 from "../img/laptop8.jpg";

const laptops = [
    {
        id: 1,
        img: laptopImg2,
        title: "Ноутбук Acer Swift 3",
        description: "Компактний та легкий ноутбук для повсякденної роботи та навчання. Чудово підходить для перегляду контенту, створення документів та роботи в офісі. Незважаючи на компактність, має достатню продуктивність для виконання щоденних завдань.",
        price: 17000,
        power: 10
    },
    {
        id: 2,
        img: laptopImg4,
        title: "Ноутбук MSI Creator Z16",
        description: "Ноутбук для творчих професіоналів. Ідеально підходить для роботи з графікою, відео та 3D-моделюванням завдяки потужному процесору та високій продуктивності. Надійність і потужність для найвимогливіших завдань.",
        price: 32000,
        power: 20
    },
    {
        id: 3,
        img: laptopImg5,
        title: "Ноутбук Dell XPS 15",
        description: "Преміальний ноутбук для роботи та розваг. Ідеальний вибір для програмістів, дизайнерів та професіоналів, які потребують високої продуктивності. Легко справляється з багатозадачністю та ресурсоємними програмами.",
        price: 26000,
        power: 12
    },
    {
        id: 4,
        img: laptopImg6,
        title: "Ноутбук ASUS ViBook 15",
        description: "Ноутбук для дому та офісу з економним споживанням енергії. Оснащений системою швидкого запуску, що дозволяє швидко розпочати роботу. Ідеальний вибір для студентів та тих, хто працює з документами.",
        price: 15500,
        power: 25
    },
    {
        id: 5,
        img: laptopImg3,
        title: "Ноутбук IdeaPad 3",
        description: "Бюджетний ноутбук для щоденних завдань. Ідеально підходить для перегляду веб-сторінок, роботи з текстом та базового мультимедіа. Компактний і легкий у використанні.",
        price: 12000
    },
    {
        id: 6,
        img: laptopImg1,
        title: "Ноутбук HP Pavilion 14",
        description: "Стильний ноутбук для офісних та домашніх завдань. Оснащений сучасним дисплеєм і тривалим часом автономної роботи, що робить його чудовим вибором для роботи на ходу.",
        price: 16000
    },
    {
        id: 7,
        img: laptopImg7,
        title: "Ноутбук Razer Blade 15",
        description: "Ноутбук для геймерів з високопродуктивним залізом. Підтримує сучасні ігри на високих налаштуваннях, забезпечуючи плавний ігровий досвід.",
        price: 34000
    },
    {
        id: 8,
        img: laptopImg8,
        title: "Ноутбук Acer Aspire 7",
        description: "Легкий і стильний ноутбук з операційною системою Windows. Ідеально підходить для студентів, блогерів та тих, хто шукає універсальний пристрій для роботи та розваг.",
        price: 18000
    }
];

export default laptops;